# # math.log(X, [base]) - логарифм X по основанию base. Если base не указан, вычисляется натуральный логарифм.

# # math.log1p(X) - натуральный логарифм (1 + X). При X → 0 точнее, чем math.log(1+X).

# # math.log10(X) - логарифм X по основанию 10.

# # math.log2(X) - логарифм X по основанию 2.

# # math.pow(X, Y) - XY.

# # math.sqrt(X) - квадратный корень из X.

# # math.sqrt(X) - квадратный корень из X.

# # math.acos(X) - арккосинус X. В радианах.

# # math.asin(X) - арксинус X. В радианах.

# # math.atan(X) - арктангенс X. В радианах.

# # math.atan2(Y, X) - арктангенс Y/X. В радианах. С учетом четверти, в которой находится точка (X, Y).

# # math.cos(X) - косинус X (X указывается в радианах).

# # math.sin(X) - синус X (X указывается в радианах).

# # math.tan(X) - тангенс X (X указывается в радианах).

# math.hypot(X, Y) - вычисляет гипотенузу треугольника с катетами X и Y (math.sqrt(x * x + y * y)).

# math.degrees(X) - конвертирует радианы в градусы.

# math.radians(X) - конвертирует градусы в радианы.

# math.cosh(X) - вычисляет гиперболический косинус.

# math.sinh(X) - вычисляет гиперболический синус.

# math.tanh(X) - вычисляет гиперболический тангенс.

# math.acosh(X) - вычисляет обратный гиперболический косинус.

# math.asinh(X) - вычисляет обратный гиперболический синус.

# math.atanh(X) - вычисляет обратный гиперболический тангенс.

# math.erf(X) - функция ошибок.

# math.erfc(X) - дополнительная функция ошибок (1 - math.erf(X)).

# math.gamma(X) - гамма-функция X.

# math.lgamma(X) - натуральный логарифм гамма-функции X.

# math.pi - pi = 3,1415926...

# math.e - e = 2,718281...

