# Напишите программу, которая считывает три числа через input() и выводит их сумму.
# Каждое число считывать в отдельной строке.

a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))

print(a + b + c)