# Создать перменную, где будет хранится ваше имя,
# например "Жаксыбек"

# Вывести текст по шаблону "Привет! Меня зовут Жаксыбек" через команду print()

first_name = "Dias"
last_name = "Dinmukhammeduly"

print(first_name + " " + last_name)